droplet/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            patch;
        nFaces          400;
        startFace       79500;
    }
    bottom
    {
        type            patch;
        nFaces          400;
        startFace       79900;
    }
    sideRight
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          100;
        startFace       80300;
        matchTolerance  0.0001;
        neighbourPatch  sideLeft;
        transformType   translational;
        separation      (0.07199999999999998 -3.388131789017201e-21 0);
    }
    sideLeft
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          100;
        startFace       80400;
        matchTolerance  0.0001;
        neighbourPatch  sideRight;
        transformType   translational;
        separation      (-0.07199999999999998 3.388131789017201e-21 0);
    }
    frontback
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          80000;
        startFace       80500;
    }
)

// ************************************************************************* //
